Revit 2026 API

# RailingHeightCorrectionOption Enumeration

---

Railing height correction option.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RailingHeightCorrectionOption
```
```vb
Public Enumeration RailingHeightCorrectionOption
```
```cpp
public enum class RailingHeightCorrectionOption
```
```fsharp
type RailingHeightCorrectionOption
```

| Member name | Value | Description |
| --- | --- | --- |
| ByType | 0 | Railing height is determined by railing type. |
| Custom | 1 | User needs to define the height value of the railing. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace